IDENTIFICATION              DIVISION.
PROGRAM-ID.                 SRJLNK002.
AUTHOR.                     WORKS.
ENVIRONMENT                 DIVISION.
CONFIGURATION               SECTION.
SOURCE-COMPUTER.        YHP
.
OBJECT-COMPUTER.        YHP.
DATA                        DIVISION.
WORKING-STORAGE SECTION.
EXEC  SQL  INCLUDE SQLCA          # END-EXEC.
EXEC  SQL  BEGIN DECLARE SECTION  # END-EXEC.
01  SQL-PAR             PIC  X(1200).
01  PRM-LIST.
03  DBNAME          PIC  X(050).
03  FILL            PIC  X(001)         VALUE X"00".
03  MENU-ID         PIC  X(032)         VALUE SPACE.
03  PGMNAME         PIC  X(009)         VALUE "srjlnk002".
03  JOB-ID          PIC  X(032)         VALUE SPACE.
03  PAR-ID          PIC S9(003)  COMP-3 VALUE 0.
03  SYA-ID          PIC S9(010)  COMP-3 VALUE 0.
03  LNK-DATE        PIC  X(025)         VALUE SPACE.
03  HR-NO           PIC S9(010)  COMP-3 VALUE 0.
03  HRRK-KB         PIC S9(003)  COMP-3 VALUE 0.
03  HR-NO-WK        PIC S9(010)  COMP-3 VALUE 0.
03  HRRK-KB-WK      PIC S9(001)  COMP-3 VALUE 0.
03  TRN-KB          PIC S9(001)  COMP-3 VALUE 0.
03  LNK-DATE-KB     PIC S9(001)  COMP-3 VALUE 0.
03  MERGE-SDATE     PIC  X(025).
03  MERGE-EDATE     PIC  X(025).
03  MERGED-EDATE    PIC  X(025).
03  MERGE-STATUS    PIC S9(001)  COMP-3.
03  LNK-EDATE       PIC  X(010)         VALUE SPACE.
01  SUBCOM-SQL-AREA.
03  SUBCOM-SQL              PIC  X(0150)      VALUE SPACE.
03  SUBCOM-SQL-SIZE         PIC S9(0009) COMP VALUE 150.
03  SUBCOM-SQL-FC           PIC S9(0009) COMP VALUE ZERO.

01  DATE-NOW-TXT.
03  NOW-YY          PIC  X(004).
03  FILL            PIC  X(001)  VALUE "/".
03  NOW-MM          PIC  X(002).
03  FILL            PIC  X(001)  VALUE "/".
03  NOW-DD          PIC  X(002).
03  FILL            PIC  X(002)  VALUE " ".
03  TIME-NOW-TXT.
05  NOW-HH      PIC  X(002).
05  FILL        PIC  X(002)  VALUE ":".
05  NOW-FF      PIC  X(002).
05  FILL        PIC  X(002)  VALUE ":".
05  NOW-SS      PIC  X(002).
01  SRK-LNK-DATE        PIC  X(010).
01  SRK-LNK-EDATE       PIC  X(010).
01  WK-PRC-DATE         PIC  X(025).
01  WK-FUTURE-DATE      PIC  X(025).
01  WK-PAST-DATE        PIC  X(025).
01  SRJLNKCTRL-REC.
03  PAST-LNK-KB         PIC S9(001)  COMP-3.
03  FUTURE-LNK-KB       PIC S9(001)  COMP-3.
03  PAST-SUSPEND-DAYS   PIC S9(003)  COMP-3.
03  FUTURE-SUSPEND-DAYS PIC S9(003)  COMP-3.
03  LNK-RESTORE         PIC S9(003)  COMP-3.
01  SRLNKTRN-REC.
03  SRT-SYA-ID          PIC S9(010)      COMP-3.
03  SRT-SRTBL-NO        PIC S9(010)      COMP-3.
03  SRT-SRFLD-ID        PIC  X(032).
03  SRT-SRFLD-OVAL      PIC  X(030).
03  SRT-SRFLD-NVAL      PIC  X(030).
03  SRT-LNK-DATE        PIC  X(025).
03  SRT-STATUS          PIC S9(001)      COMP-3.
03  SRT-HR-NO           PIC S9(010)      COMP-3.
03  SRT-HRRK-KB         PIC S9(003)      COMP-3.
03  SRT-TRN-KB          PIC S9(001)      COMP-3.
03  SRT-KNM-SEQ         PIC S9(010)       COMP-3.
03  SRT-ENTRY-KB        PIC S9(001)      COMP-3.
03  SRT-LNK-DATE-KB     PIC S9(001)      COMP-3.
01  SRMST-MAX                     PIC S9(007)  COMP-3 VALUE 1000.
01  SRKNM-MAX                     PIC S9(007)  COMP-3 VALUE  30.
01  WK-STATUS                     PIC S9(003)       COMP-3.
01  TGT-STATUS                    PIC S9(003)       COMP-3.
01  SRMST-REC.
03  CNT-SRMST                 PIC S9(007)  COMP-3.
05  SRM-SYA-ID            PIC S9(010)       COMP-3.
05  SRM-SDATE             PIC  X(025).
05  SRM-EDATE             PIC  X(025).
05  SRM-HR-NO             PIC S9(010)       COMP-3.
05  SRM-HRRK-KB           PIC S9(001)       COMP-3.
05  SRM-STATUS            PIC S9(003)       COMP-3.
05  SRM-TRG-KB            PIC S9(003)       COMP-3.
05  SRM-SR-SYZ-CD         PIC  X(014).
05  SRM-SYZ-PRC-DATE      PIC  X(025).
05  SRM-SYZ-HAT-DATE      PIC  X(025).
05  SRM-CHAKUNIN-DATE     PIC  X(025).
05  SRM-KINMU-SYUBETU-CD  PIC  X(010).
05  SRM-KS-PRC-DATE       PIC  X(025).
05  SRM-KYUMU-SYUBETU-CD  PIC  X(010).
05  SRM-JITAN-KINMU-KB    PIC S9(001)       COMP-3.
05  SRM-JITAN-KINMU-CD    PIC  X(010).
05  SRM-JITAN-SYUBETU-CD  PIC  X(010).
05  SRM-SIME-CD           PIC  X(010).
05  SRM-CAL-CD            PIC  X(010).
05  SRM-KINMU-CAL-CD      PIC  X(020).
05  SRM-HOLIDAY-TYPE-CD   PIC  X(010).
05  SRM-HT-PRC-DATE       PIC  X(025).
05  SRM-SAGYO-KEITAI-KB   PIC S9(003)       COMP-3.
05  SRM-SAGYO-KEITAI-CD   PIC  X(010).
05  SRM-PROJECT-KB        PIC S9(003)       COMP-3.
05  SRM-KINMUNY-KB        PIC S9(003)       COMP-3.
05  SRM-KINMUNY-CD        PIC  X(010).
05  SRM-SYORI-KB          PIC S9(003)       COMP-3.
05  SRM-SSYORIGRP-CD      PIC  X(016).
05  SRM-KYUKA-KEITAI-CD   PIC  X(010).
05  SRM-SUMSYA-KB         PIC  X(010).
05  SRM-KINMU-PTN-CD1     PIC  X(014).
05  SRM-KINMU-PTN-CD2     PIC  X(014).
05  SRM-KINMU-PTN-CD3     PIC  X(014).
05  SRM-KINMU-PTN-CD4     PIC  X(014).
05  SRM-JIKAN-CHECK-CD1   PIC  X(014).
05  SRM-JIKAN-CHECK-CD2   PIC  X(014).
05  SRM-JIKAN-CHECK-CD3   PIC  X(014).
05  SRM-SR-SYZ-CD-BK      PIC  X(014).
05  SRM-OUEN-FLG          PIC S9(003)       COMP-3.
05  SRM-KANRI-KB          PIC S9(003)       COMP-3.
05  SRM-ADMIN-KB          PIC S9(003)       COMP-3.
05  SRM-CAL-KB            PIC S9(001)       COMP-3.
05  SRM-NK-KINZ-KDT       PIC  X(025).
05  SRM-NK-FUYO-KDT       PIC  X(025).
05  SRM-RK-KINZ-KDT       PIC  X(025).
05  SRM-RK-FUYO-KDT       PIC  X(025).
05  SRM-IK-KINZ-KDT       PIC  X(025).
05  SRM-SYUK-KB           PIC S9(005)       COMP-3.
05  SRM-TAIS-KB           PIC S9(005)       COMP-3.
05  SRM-KYUS-KB           PIC S9(005)       COMP-3.
05  SRM-KAI-CD            PIC  X(020).
05  SRM-SKAI-CD           PIC  X(020).
05  SRM-GKAI-CD           PIC  X(020).
05  SRM-GSYZ-CD           PIC  X(014).
05  SRM-KYUSJ-CD          PIC  X(002).
05  SRM-KK-SYORI-CD       PIC  X(010).
05  SRM-KKOJ-MT           PIC S9(005)       COMP-3.
05  SRM-KKOJ-DT           PIC S9(005)       COMP-3.
05  SRM-IKKOJ-MT          PIC S9(005)       COMP-3.
05  SRM-IKKOJ-DT          PIC S9(005)       COMP-3.
05  SRM-KYUSTKKB          PIC S9(005)       COMP-3.
05  SRM-RENKYUS-TDT       PIC  X(025).
05  SRM-RENSYUK-TDT       PIC  X(025).
05  SRM-SR-SYA-KB         PIC S9(005)       COMP-3.
05  SRM-KUMI-KB           PIC S9(005)       COMP-3.
05  SRM-GENERAL-CD1       PIC  X(014).
05  SRM-GENERAL-CD2       PIC  X(014).
05  SRM-GENERAL-CD3       PIC  X(014).
05  SRM-GENERAL-CD4       PIC  X(014).
05  SRM-GENERAL-CD5       PIC  X(014).
05  SRM-GENERAL-CD6       PIC  X(014).
05  SRM-GENERAL-CD7       PIC  X(014).
05  SRM-GENERAL-CD8       PIC  X(014).
05  SRM-GENERAL-CD9       PIC  X(014).
05  SRM-GENERAL-CD10      PIC  X(014).
05  SRM-GENERAL-CD11      PIC  X(014).
05  SRM-GENERAL-CD12      PIC  X(014).
05  SRM-GENERAL-CD13      PIC  X(014).
05  SRM-GENERAL-CD14      PIC  X(014).
05  SRM-GENERAL-CD15      PIC  X(014).
05  SRM-GENERAL-CD16      PIC  X(014).
05  SRM-GENERAL-CD17      PIC  X(014).
05  SRM-GENERAL-CD18      PIC  X(014).
05  SRM-GENERAL-CD19      PIC  X(014).
05  SRM-GENERAL-CD20      PIC  X(014).
05  SRM-GENERAL-CD21      PIC  X(014).
05  SRM-GENERAL-CD22      PIC  X(014).
05  SRM-GENERAL-CD23      PIC  X(014).
05  SRM-GENERAL-CD24      PIC  X(014).
05  SRM-GENERAL-CD25      PIC  X(014).
05  SRM-GENERAL-CD26      PIC  X(014).
05  SRM-GENERAL-CD27      PIC  X(014).
05  SRM-GENERAL-CD28      PIC  X(014).
05  SRM-GENERAL-CD29      PIC  X(014).
05  SRM-GENERAL-CD30      PIC  X(014).
05  SRM-BOSS-KB           PIC S9(003)       COMP-3.
05  SRM-UNIT-SHIFT-KB     PIC S9(003)       COMP-3.
05  SRM-MLTCPNY-CD        PIC  X(020).
05  CNT-SRKNM             PIC S9(003)       COMP-3.
07  SRK-KNM-SEQ           PIC S9(010)       COMP-3.
07  SRK-END-STATUS        PIC S9(001)       COMP-3.
07  SRK-K-SR-SYZ-CD       PIC  X(014).
07  SRK-K-GENERAL-CD01    PIC  X(020).
07  SRK-K-GENERAL-CD02    PIC  X(020).
07  SRK-K-GENERAL-CD03    PIC  X(020).
07  SRK-K-GENERAL-CD04    PIC  X(020).
07  SRK-K-GENERAL-CD05    PIC  X(020).
07  SRK-K-GENERAL-CD06    PIC  X(020).
07  SRK-K-GENERAL-CD07    PIC  X(020).
07  SRK-K-GENERAL-CD08    PIC  X(020).
07  SRK-K-GENERAL-CD09    PIC  X(020).
07  SRK-K-GENERAL-CD10    PIC  X(020).
07  SRK-STATUS            PIC S9(003)       COMP-3.
07  SRK-INSERT-FLG        PIC S9(001)       COMP-3.
07  SRK-DUMMY-FLG         PIC S9(001)       COMP-3.
07  SRK-IS-STS0-FLG       PIC S9(001)       COMP-3.
01  WK-SRMST-REC.
03  WSRM-SYA-ID               PIC S9(010)       COMP-3.
03  WSRM-SDATE                PIC  X(025).
03  WSRM-EDATE                PIC  X(025).
03  WSRM-HR-NO                PIC S9(010)       COMP-3.
03  WSRM-HRRK-KB              PIC S9(001)       COMP-3.
03  WSRM-STATUS               PIC S9(003)       COMP-3.
03  WSRM-TRG-KB               PIC S9(003)       COMP-3.
03  WSRM-SR-SYZ-CD            PIC  X(014).
03  WSRM-SYZ-PRC-DATE         PIC  X(025).
03  WSRM-SYZ-HAT-DATE         PIC  X(025).
03  WSRM-CHAKUNIN-DATE        PIC  X(025).
03  WSRM-KINMU-SYUBETU-CD     PIC  X(010).
03  WSRM-KS-PRC-DATE          PIC  X(025).
03  WSRM-KYUMU-SYUBETU-CD     PIC  X(010).
03  WSRM-JITAN-KINMU-KB       PIC S9(001)       COMP-3.
03  WSRM-JITAN-KINMU-CD       PIC  X(010).
03  WSRM-JITAN-SYUBETU-CD     PIC  X(010).
03  WSRM-SIME-CD              PIC  X(010).
03  WSRM-CAL-CD               PIC  X(010).
03  WSRM-KINMU-CAL-CD         PIC  X(020).
03  WSRM-HOLIDAY-TYPE-CD      PIC  X(010).
03  WSRM-HT-PRC-DATE          PIC  X(025).
03  WSRM-SAGYO-KEITAI-KB      PIC S9(003)       COMP-3.
03  WSRM-SAGYO-KEITAI-CD      PIC  X(010).
03  WSRM-PROJECT-KB           PIC S9(003)       COMP-3.
03  WSRM-KINMUNY-KB           PIC S9(003)       COMP-3.
03  WSRM-KINMUNY-CD           PIC  X(010).
03  WSRM-SYORI-KB             PIC S9(003)       COMP-3.
03  WSRM-SSYORIGRP-CD         PIC  X(016).
03  WSRM-KYUKA-KEITAI-CD      PIC  X(010).
03  WSRM-SUMSYA-KB            PIC  X(010).
03  WSRM-KINMU-PTN-CD1        PIC  X(014).
03  WSRM-KINMU-PTN-CD2        PIC  X(014).
03  WSRM-KINMU-PTN-CD3        PIC  X(014).
03  WSRM-KINMU-PTN-CD4        PIC  X(014).
03  WSRM-JIKAN-CHECK-CD1      PIC  X(014).
03  WSRM-JIKAN-CHECK-CD2      PIC  X(014).
03  WSRM-JIKAN-CHECK-CD3      PIC  X(014).
03  WSRM-SR-SYZ-CD-BK         PIC  X(014).
03  WSRM-OUEN-FLG             PIC S9(003)       COMP-3.
03  WSRM-KANRI-KB             PIC S9(003)       COMP-3.
03  WSRM-ADMIN-KB             PIC S9(003)       COMP-3.
03  WSRM-CAL-KB               PIC S9(001)       COMP-3.
03  WSRM-NK-KINZ-KDT          PIC  X(025).
03  WSRM-NK-FUYO-KDT          PIC  X(025).
03  WSRM-RK-KINZ-KDT          PIC  X(025).
03  WSRM-RK-FUYO-KDT          PIC  X(025).
03  WSRM-IK-KINZ-KDT          PIC  X(025).
03  WSRM-SYUK-KB              PIC S9(005)       COMP-3.
03  WSRM-TAIS-KB              PIC S9(005)       COMP-3.
03  WSRM-KYUS-KB              PIC S9(005)       COMP-3.
03  WSRM-KAI-CD               PIC  X(020).
03  WSRM-SKAI-CD              PIC  X(020).
03  WSRM-GKAI-CD              PIC  X(020).
03  WSRM-GSYZ-CD              PIC  X(014).
03  WSRM-KYUSJ-CD             PIC  X(002).
03  WSRM-KK-SYORI-CD          PIC  X(010).
03  WSRM-KKOJ-MT              PIC S9(005)       COMP-3.
03  WSRM-KKOJ-DT              PIC S9(005)       COMP-3.
03  WSRM-IKKOJ-MT             PIC S9(005)       COMP-3.
03  WSRM-IKKOJ-DT             PIC S9(005)       COMP-3.
03  WSRM-KYUSTKKB             PIC S9(005)       COMP-3.
03  WSRM-RENKYUS-TDT          PIC  X(025).
03  WSRM-RENSYUK-TDT          PIC  X(025).
03  WSRM-SR-SYA-KB            PIC S9(005)       COMP-3.
03  WSRM-KUMI-KB              PIC S9(005)       COMP-3.
03  WSRM-GENERAL-CD1          PIC  X(014).
03  WSRM-GENERAL-CD2          PIC  X(014).
03  WSRM-GENERAL-CD3          PIC  X(014).
03  WSRM-GENERAL-CD4          PIC  X(014).
03  WSRM-GENERAL-CD5          PIC  X(014).
03  WSRM-GENERAL-CD6          PIC  X(014).
03  WSRM-GENERAL-CD7          PIC  X(014).
03  WSRM-GENERAL-CD8          PIC  X(014).
03  WSRM-GENERAL-CD9          PIC  X(014).
03  WSRM-GENERAL-CD10         PIC  X(014).
03  WSRM-GENERAL-CD11         PIC  X(014).
03  WSRM-GENERAL-CD12         PIC  X(014).
03  WSRM-GENERAL-CD13         PIC  X(014).
03  WSRM-GENERAL-CD14         PIC  X(014).
03  WSRM-GENERAL-CD15         PIC  X(014).
03  WSRM-GENERAL-CD16         PIC  X(014).
03  WSRM-GENERAL-CD17         PIC  X(014).
03  WSRM-GENERAL-CD18         PIC  X(014).
03  WSRM-GENERAL-CD19         PIC  X(014).
03  WSRM-GENERAL-CD20         PIC  X(014).
03  WSRM-GENERAL-CD21         PIC  X(014).
03  WSRM-GENERAL-CD22         PIC  X(014).
03  WSRM-GENERAL-CD23         PIC  X(014).
03  WSRM-GENERAL-CD24         PIC  X(014).
03  WSRM-GENERAL-CD25         PIC  X(014).
03  WSRM-GENERAL-CD26         PIC  X(014).
03  WSRM-GENERAL-CD27         PIC  X(014).
03  WSRM-GENERAL-CD28         PIC  X(014).
03  WSRM-GENERAL-CD29         PIC  X(014).
03  WSRM-GENERAL-CD30         PIC  X(014).
03  WSRM-BOSS-KB              PIC S9(003)       COMP-3.
03  WSRM-UNIT-SHIFT-KB        PIC S9(003)       COMP-3.
03  WSRM-MLTCPNY-CD           PIC  X(020).
01  CP-SRMST-REC.
03  CSRM-SYA-ID               PIC S9(010)       COMP-3.
03  CSRM-SDATE                PIC  X(025).
03  CSRM-EDATE                PIC  X(025).
03  CSRM-HR-NO                PIC S9(010)       COMP-3.
03  CSRM-HRRK-KB              PIC S9(001)       COMP-3.
03  CSRM-STATUS               PIC S9(003)       COMP-3.
03  CSRM-TRG-KB               PIC S9(003)       COMP-3.
03  CSRM-SR-SYZ-CD            PIC  X(014).
03  CSRM-SYZ-PRC-DATE         PIC  X(025).
03  CSRM-SYZ-HAT-DATE         PIC  X(025).
03  CSRM-CHAKUNIN-DATE        PIC  X(025).
03  CSRM-KINMU-SYUBETU-CD     PIC  X(010).
03  CSRM-KS-PRC-DATE          PIC  X(025).
03  CSRM-KYUMU-SYUBETU-CD     PIC  X(010).
03  CP-JITAN-KINMU-KB.
05  CSRM-JITAN-KINMU-KB     PIC S9(001)       COMP-3.
03  CSRM-JITAN-KINMU-CD       PIC  X(010).
03  CSRM-JITAN-SYUBETU-CD     PIC  X(010).
03  CSRM-SIME-CD              PIC  X(010).
03  CSRM-CAL-CD               PIC  X(010).
03  CSRM-KINMU-CAL-CD         PIC  X(020).
03  CSRM-HOLIDAY-TYPE-CD      PIC  X(010).
03  CSRM-HT-PRC-DATE          PIC  X(025).
03  CP-SAGYO-KEITAI-KB.
05  CSRM-SAGYO-KEITAI-KB    PIC S9(003)       COMP-3.
03  CSRM-SAGYO-KEITAI-CD      PIC  X(010).
03  CP-PROJECT-KB.
05  CSRM-PROJECT-KB         PIC S9(003)       COMP-3.
03  CP-KINMUNY-KB.
05  CSRM-KINMUNY-KB         PIC S9(003)       COMP-3.
03  CSRM-KINMUNY-CD           PIC  X(010).
03  CP-SYORI-KB.
05  CSRM-SYORI-KB           PIC S9(003)       COMP-3.
03  CSRM-SSYORIGRP-CD         PIC  X(016).
03  CSRM-KYUKA-KEITAI-CD      PIC  X(010).
03  CSRM-SUMSYA-KB            PIC  X(010).
03  CSRM-KINMU-PTN-CD1        PIC  X(014).
03  CSRM-KINMU-PTN-CD2        PIC  X(014).
03  CSRM-KINMU-PTN-CD3        PIC  X(014).
03  CSRM-KINMU-PTN-CD4        PIC  X(014).
03  CSRM-JIKAN-CHECK-CD1      PIC  X(014).
03  CSRM-JIKAN-CHECK-CD2      PIC  X(014).
03  CSRM-JIKAN-CHECK-CD3      PIC  X(014).
03  CSRM-SR-SYZ-CD-BK         PIC  X(014).
03  CSRM-OUEN-FLG             PIC S9(003)       COMP-3.
03  CP-KANRI-KB.
05  CSRM-KANRI-KB           PIC S9(003)       COMP-3.
03  CP-ADMIN-KB.
05  CSRM-ADMIN-KB           PIC S9(003)       COMP-3.
03  CP-CAL-KB.
05  CSRM-CAL-KB             PIC S9(001)       COMP-3.
03  CSRM-NK-KINZ-KDT          PIC  X(025).
03  CSRM-NK-FUYO-KDT          PIC  X(025).
03  CSRM-RK-KINZ-KDT          PIC  X(025).
03  CSRM-RK-FUYO-KDT          PIC  X(025).
03  CSRM-IK-KINZ-KDT          PIC  X(025).
03  CP-SYUK-KB.
05  CSRM-SYUK-KB            PIC S9(005)       COMP-3.
03  CP-TAIS-KB.
05  CSRM-TAIS-KB            PIC S9(005)       COMP-3.
03  CP-KYUS-KB.
05  CSRM-KYUS-KB            PIC S9(005)       COMP-3.
03  CSRM-KAI-CD               PIC  X(020).
03  CSRM-SKAI-CD              PIC  X(020).
03  CSRM-GKAI-CD              PIC  X(020).
03  CSRM-GSYZ-CD              PIC  X(014).
03  CSRM-KYUSJ-CD             PIC  X(002).
03  CSRM-KK-SYORI-CD          PIC  X(010).
03  CP-KKOJ-MT.
05  CSRM-KKOJ-MT            PIC S9(005)       COMP-3.
03  CP-KKOJ-DT.
05  CSRM-KKOJ-DT            PIC S9(005)       COMP-3.
03  CP-IKKOJ-MT.
05  CSRM-IKKOJ-MT           PIC S9(005)       COMP-3.
03  CP-IKKOJ-DT.
05  CSRM-IKKOJ-DT           PIC S9(005)       COMP-3.
03  CP-KYUSTKKB.
05  CSRM-KYUSTKKB           PIC S9(005)       COMP-3.
03  CSRM-RENKYUS-TDT          PIC  X(025).
03  CSRM-RENSYUK-TDT          PIC  X(025).
03  CP-SR-SYA-KB.
05  CSRM-SR-SYA-KB          PIC S9(005)       COMP-3.
03  CP-KUMI-KB.
05  CSRM-KUMI-KB            PIC S9(005)       COMP-3.
03  CSRM-GENERAL-CD1          PIC  X(014).
03  CSRM-GENERAL-CD2          PIC  X(014).
03  CSRM-GENERAL-CD3          PIC  X(014).
03  CSRM-GENERAL-CD4          PIC  X(014).
03  CSRM-GENERAL-CD5          PIC  X(014).
03  CSRM-GENERAL-CD6          PIC  X(014).
03  CSRM-GENERAL-CD7          PIC  X(014).
03  CSRM-GENERAL-CD8          PIC  X(014).
03  CSRM-GENERAL-CD9          PIC  X(014).
03  CSRM-GENERAL-CD10         PIC  X(014).
03  CSRM-GENERAL-CD11         PIC  X(014).
03  CSRM-GENERAL-CD12         PIC  X(014).
03  CSRM-GENERAL-CD13         PIC  X(014).
03  CSRM-GENERAL-CD14         PIC  X(014).
03  CSRM-GENERAL-CD15         PIC  X(014).
03  CSRM-GENERAL-CD16         PIC  X(014).
03  CSRM-GENERAL-CD17         PIC  X(014).
03  CSRM-GENERAL-CD18         PIC  X(014).
03  CSRM-GENERAL-CD19         PIC  X(014).
03  CSRM-GENERAL-CD20         PIC  X(014).
03  CSRM-GENERAL-CD21         PIC  X(014).
03  CSRM-GENERAL-CD22         PIC  X(014).
03  CSRM-GENERAL-CD23         PIC  X(014).
03  CSRM-GENERAL-CD24         PIC  X(014).
03  CSRM-GENERAL-CD25         PIC  X(014).
03  CSRM-GENERAL-CD26         PIC  X(014).
03  CSRM-GENERAL-CD27         PIC  X(014).
03  CSRM-GENERAL-CD28         PIC  X(014).
03  CSRM-GENERAL-CD29         PIC  X(014).
03  CSRM-GENERAL-CD30         PIC  X(014).
03  CP-BOSS-KB.
05  CSRM-BOSS-KB            PIC S9(003)       COMP-3.
03  CP-UNIT-SHIFT-KB.
05  CSRM-UNIT-SHIFT-KB      PIC S9(003)       COMP-3.
03  CSRM-MLTCPNY-CD           PIC  X(020).
03  CSRM-CNT-SRKNM            PIC S9(003)       COMP-3.
05  CSRK-KNM-SEQ           PIC S9(010)       COMP-3.
05  CSRK-END-STATUS        PIC S9(001)       COMP-3.
05  CSRK-K-SR-SYZ-CD       PIC  X(014).
05  CSRK-K-GENERAL-CD01    PIC  X(020).
05  CSRK-K-GENERAL-CD02    PIC  X(020).
05  CSRK-K-GENERAL-CD03    PIC  X(020).
05  CSRK-K-GENERAL-CD04    PIC  X(020).
05  CSRK-K-GENERAL-CD05    PIC  X(020).
05  CSRK-K-GENERAL-CD06    PIC  X(020).
05  CSRK-K-GENERAL-CD07    PIC  X(020).
05  CSRK-K-GENERAL-CD08    PIC  X(020).
05  CSRK-K-GENERAL-CD09    PIC  X(020).
05  CSRK-K-GENERAL-CD10    PIC  X(020).
05  CSRK-STATUS            PIC S9(003)       COMP-3.
05  CSRK-INSERT-FLG        PIC S9(001)       COMP-3.
05  CSRK-DUMMY-FLG         PIC S9(001)       COMP-3.
05  CSRK-IS-STS0-FLG       PIC S9(001)       COMP-3.
01  SRMST-COMPARE-REC.
05  COM-SYA-ID           PIC S9(010)       COMP-3.
05  COM-SDATE            PIC  X(025).
05  COM-EDATE            PIC  X(025).
05  COM-HR-NO            PIC S9(010)       COMP-3.
05  COM-HRRK-KB          PIC S9(001)       COMP-3.
05  COM-STATUS           PIC S9(003)       COMP-3.
05  COM-TRG-KB           PIC S9(003)       COMP-3.
05  COM-SONOTA.
07  COM-SR-SYZ-CD        PIC  X(014).
07  COM-SYZ-PRC-DATE     PIC  X(025).
07  COM-SYZ-HAT-DATE     PIC  X(025).
07  COM-CHAKUNIN-DATE    PIC  X(025).
07  COM-KINMU-SYUBETU-CD PIC  X(010).
07  COM-KS-PRC-DATE      PIC  X(025).
07  COM-KYUMU-SYUBETU-CD PIC  X(010).
07  COM-JITAN-KINMU-KB   PIC S9(001)       COMP-3.
07  COM-JITAN-KINMU-CD   PIC  X(010).
07  COM-JITAN-SYUBETU-CD PIC  X(010).
07  COM-SIME-CD          PIC  X(010).
07  COM-CAL-CD           PIC  X(010).
07  COM-KINMU-CAL-CD     PIC  X(020).
07  COM-HOLIDAY-TYPE-CD  PIC  X(010).
07  COM-HT-PRC-DATE      PIC  X(025).
07  COM-SAGYO-KEITAI-KB  PIC S9(003)       COMP-3.
07  COM-SAGYO-KEITAI-CD  PIC  X(010).
07  COM-PROJECT-KB       PIC S9(003)       COMP-3.
07  COM-KINMUNY-KB       PIC S9(003)       COMP-3.
07  COM-KINMUNY-CD       PIC  X(010).
07  COM-SYORI-KB         PIC S9(003)       COMP-3.
07  COM-SSYORIGRP-CD     PIC  X(016).
07  COM-KYUKA-KEITAI-CD  PIC  X(010).
07  COM-SUMSYA-KB        PIC  X(010).
07  COM-KINMU-PTN-CD1    PIC  X(014).
07  COM-KINMU-PTN-CD2    PIC  X(014).
07  COM-KINMU-PTN-CD3    PIC  X(014).
07  COM-KINMU-PTN-CD4    PIC  X(014).
07  COM-JIKAN-CHECK-CD1  PIC  X(014).
07  COM-JIKAN-CHECK-CD2  PIC  X(014).
07  COM-JIKAN-CHECK-CD3  PIC  X(014).
07  COM-SR-SYZ-CD-BK     PIC  X(014).
07  COM-OUEN-FLG         PIC S9(003)       COMP-3.
07  COM-KANRI-KB         PIC S9(003)       COMP-3.
07  COM-ADMIN-KB         PIC S9(003)       COMP-3.
07  COM-CAL-KB           PIC S9(001)       COMP-3.
07  COM-NK-KINZ-KDT      PIC  X(025).
07  COM-NK-FUYO-KDT      PIC  X(025).
07  COM-RK-KINZ-KDT      PIC  X(025).
07  COM-RK-FUYO-KDT      PIC  X(025).
07  COM-IK-KINZ-KDT      PIC  X(025).
07  COM-SYUK-KB          PIC S9(005)       COMP-3.
07  COM-TAIS-KB          PIC S9(005)       COMP-3.
07  COM-KYUS-KB          PIC S9(005)       COMP-3.
07  COM-KAI-CD           PIC  X(020).
07  COM-SKAI-CD          PIC  X(020).
07  COM-GKAI-CD          PIC  X(020).
07  COM-GSYZ-CD          PIC  X(014).
07  COM-KYUSJ-CD         PIC  X(002).
07  COM-KK-SYORI-CD      PIC  X(010).
07  COM-KKOJ-MT          PIC S9(005)       COMP-3.
07  COM-KKOJ-DT          PIC S9(005)       COMP-3.
07  COM-IKKOJ-MT         PIC S9(005)       COMP-3.
07  COM-IKKOJ-DT         PIC S9(005)       COMP-3.
07  COM-KYUSTKKB         PIC S9(005)       COMP-3.
07  COM-RENKYUS-TDT      PIC  X(025).
07  COM-RENSYUK-TDT      PIC  X(025).
07  COM-SR-SYA-KB        PIC S9(005)       COMP-3.
07  COM-KUMI-KB          PIC S9(005)       COMP-3.
07  COM-GENERAL-CD1      PIC  X(014).
07  COM-GENERAL-CD2      PIC  X(014).
07  COM-GENERAL-CD3      PIC  X(014).
07  COM-GENERAL-CD4      PIC  X(014).
07  COM-GENERAL-CD5      PIC  X(014).
07  COM-GENERAL-CD6      PIC  X(014).
07  COM-GENERAL-CD7      PIC  X(014).
07  COM-GENERAL-CD8      PIC  X(014).
07  COM-GENERAL-CD9      PIC  X(014).
07  COM-GENERAL-CD10     PIC  X(014).
07  COM-GENERAL-CD11     PIC  X(014).
07  COM-GENERAL-CD12     PIC  X(014).
07  COM-GENERAL-CD13     PIC  X(014).
07  COM-GENERAL-CD14     PIC  X(014).
07  COM-GENERAL-CD15     PIC  X(014).
07  COM-GENERAL-CD16     PIC  X(014).
07  COM-GENERAL-CD17     PIC  X(014).
07  COM-GENERAL-CD18     PIC  X(014).
07  COM-GENERAL-CD19     PIC  X(014).
07  COM-GENERAL-CD20     PIC  X(014).
07  COM-GENERAL-CD21     PIC  X(014).
07  COM-GENERAL-CD22     PIC  X(014).
07  COM-GENERAL-CD23     PIC  X(014).
07  COM-GENERAL-CD24     PIC  X(014).
07  COM-GENERAL-CD25     PIC  X(014).
07  COM-GENERAL-CD26     PIC  X(014).
07  COM-GENERAL-CD27     PIC  X(014).
07  COM-GENERAL-CD28     PIC  X(014).
07  COM-GENERAL-CD29     PIC  X(014).
07  COM-GENERAL-CD30     PIC  X(014).
07  COM-BOSS-KB          PIC S9(003)       COMP-3.
07  COM-UNIT-SHIFT-KB    PIC S9(003)       COMP-3.
07  COM-MLTCPNY-CD       PIC  X(020).
07  COM-CNT-SRKNM        PIC S9(003)       COMP-3.
09  COM-KNM-SEQ           PIC S9(010)    COMP-3.
09  COM-END-STATUS        PIC S9(001)    COMP-3.
09  COM-K-SR-SYZ-CD       PIC  X(014).
09  COM-K-GENERAL-CD01    PIC  X(020).
09  COM-K-GENERAL-CD02    PIC  X(020).
09  COM-K-GENERAL-CD03    PIC  X(020).
09  COM-K-GENERAL-CD04    PIC  X(020).
09  COM-K-GENERAL-CD05    PIC  X(020).
09  COM-K-GENERAL-CD06    PIC  X(020).
09  COM-K-GENERAL-CD07    PIC  X(020).
09  COM-K-GENERAL-CD08    PIC  X(020).
09  COM-K-GENERAL-CD09    PIC  X(020).
09  COM-K-GENERAL-CD10    PIC  X(020).
09  COM-SRK-STATUS        PIC S9(003)    COMP-3.
09  COM-SRK-INSERT-FLG    PIC S9(001)    COMP-3.
09  COM-INSERT-FLG        PIC S9(001)    COMP-3.
09  COM-IS-STS0-FLG       PIC S9(001)    COMP-3.
01  WSRK-SYA-ID               PIC S9(010)       COMP-3.
01  WSRK-SDATE                PIC  X(010).
01  WSRK-EDATE                PIC  X(010).
01  WK-SRKNM-REC.
03  WSRK-KNM-SEQ              PIC S9(010)       COMP-3.
03  WSRK-END-STATUS           PIC S9(001)       COMP-3.
03  WSRK-K-SR-SYZ-CD          PIC  X(014).
03  WSRK-K-GENERAL-CD01       PIC  X(020).
03  WSRK-K-GENERAL-CD02       PIC  X(020).
03  WSRK-K-GENERAL-CD03       PIC  X(020).
03  WSRK-K-GENERAL-CD04       PIC  X(020).
03  WSRK-K-GENERAL-CD05       PIC  X(020).
03  WSRK-K-GENERAL-CD06       PIC  X(020).
03  WSRK-K-GENERAL-CD07       PIC  X(020).
03  WSRK-K-GENERAL-CD08       PIC  X(020).
03  WSRK-K-GENERAL-CD09       PIC  X(020).
03  WSRK-K-GENERAL-CD10       PIC  X(020).
03  WSRK-STATUS               PIC S9(003)       COMP-3.
03  WSRK-INSERT-FLG           PIC S9(001)       COMP-3.
03  WSRK-DUMMY-FLG            PIC S9(001)       COMP-3.
03  WSRK-IS-STS0-FLG          PIC S9(001)       COMP-3.
01  SEC-WK.
03  SEC-JOBID           PIC  X(032).
03  SEC-ENABLED         PIC S9(003)  COMP-3.
03  SEC-DATE            PIC  X(025).
01  PAR-ID-STR              PIC  X(005).
01  PARA-CONTR.
03  PR-CNT              PIC S9(003)  COMP-3.
03  PR-TIME             PIC S9(005)  COMP-3 VALUE ZERO.
01  PM-ERROR-CNT            PIC S9(003)  COMP-3.
01  JL-PARA-CNT             PIC S9(003)  COMP-3.
01  JL-PARA-OK-CNT          PIC S9(003)  COMP-3.
01  SIM-WK.
03  P-SIM-KB            PIC  X(003)  VALUE SPACE.
03  SIM-KB              PIC S9(001)  COMP-3.
03  USE-SIM             PIC S9(001)  COMP-3.
03  DOING-SIM           PIC S9(001)  COMP-3.
01  DBHR-MAX               PIC S9(007) COMP-3  VALUE 1000.
01  CNT-DBHR               PIC S9(007) COMP-3.
01  DBHR-REC.
01  KIHON-HR-MAX           PIC S9(007) COMP-3  VALUE 1000.
01  CNT-KIHON-HR           PIC S9(007) COMP-3.
01  KIHON-HR-REC.
01  DBTRNRK-MAX            PIC S9(007) COMP-3  VALUE 1000.
01  CNT-DBTRNRK            PIC S9(007) COMP-3.
01  DBTRNRK-REC.
01  CONST-AREA.
03  C-PGMID             PIC  X(009)  VALUE "SRJLNK002".
03  C-MAX-DATE          PIC  X(010)  VALUE "2382/12/31".
03  C-VERSION           PIC  X(012)  VALUE "33010100".


01  WS-SRLNKTRN-REC.
03  CNT-LNKTRN               PIC  9(007).
05  WS-SRTBL-NO         PIC S9(010)      COMP-3.
05  WS-SRFLD-ID         PIC  X(032).
05  WS-SRFLD-OVAL       PIC  X(030).
05  WS-SRFLD-OVAL-J     PIC  X(030).
05  WS-SRFLD-NVAL       PIC  X(030).
05  WS-SRFLD-NVAL-J     PIC  X(030).
05  WS-LNK-DATE         PIC  X(025).
05  WS-TRN-KB           PIC S9(001)      COMP-3.
05  WS-KNM-SEQ          PIC S9(010)       COMP-3.
05  WS-HR-NO            PIC S9(010)      COMP-3.
05  WS-HRRK-KB          PIC S9(003)      COMP-3.
05  WS-STATUS           PIC S9(001)      COMP-3.
05  WS-ENTRY-KB         PIC S9(001)      COMP-3.
05  WS-SYORI-FLG        PIC S9(001)       COMP-3.
01  WORK-AREA.
03  OLD-SYA-ID          PIC S9(010)  COMP-3.
03  OLD-LNK-DATE        PIC  X(025).
03  OLD-HR-NO           PIC S9(010)  COMP-3.
03  OLD-HRRK-KB         PIC S9(003)  COMP-3.
03  OLD-STATUS          PIC S9(001)  COMP-3.
03  OLD-TRN-KB          PIC S9(001)  COMP-3.
03  OLD-LNK-DATE-KB     PIC S9(001)  COMP-3.
03  SRFLD-ID            PIC  X(032).
03  WK-VAL-CHR          PIC  X(030).
03  WK-VAL-CHR-R REDEFINES WK-VAL-CHR.
03  WK-VAL-DECEDT       PIC  ----------9.
03  WK-VAL-DECEDT-R REDEFINES WK-VAL-DECEDT.
03  DATE-NOW.
05  DATE-NOW-YY     PIC  X(004).
05  DATE-NOW-MM     PIC  X(002).
05  DATE-NOW-DD     PIC  X(002).
05  DATE-NOW-HH     PIC  X(002).
05  DATE-NOW-FF     PIC  X(002).
05  DATE-NOW-SS     PIC  X(002).
05  FILLER          PIC  X(007).
03  WK-ADD-DAYS         PIC S9(003)      COMP-3.
03  WK-DATE             PIC  X(010).
03  TMP-DATE-NUM        PIC S9(008)      COMP-3.
03  TMP-YEAR            PIC S9(004)      COMP-3.
03  TMP-MONTH           PIC S9(002)      COMP-3.
03  TMP-DAY             PIC S9(002)      COMP-3.
03  TMP-YEAR-STR        PIC  X(004).
03  TMP-MONTH-STR       PIC  X(002).
03  TMP-DAY-STR         PIC  X(002).
03  STRING-POINTER      PIC S9(001)      COMP-3.
01  FLG-AREA.
03  LNKSYAIN-EOF-FLG    PIC  9(001).
03  RESTORE-EOF-FLG     PIC  9(001).
03  CHK-STS1-FLG        PIC  9(001).
03  IS-STS0-FLG         PIC  9(001).
03  SRM-EQUAL-DATE      PIC  9(001).
03  SAME-DATA-FLG       PIC  9(001).
03  FLG-END             PIC  9(001).
01  IDX-AREA.
03  IX                  PIC S9(005)  COMP-3.
03  IY                  PIC S9(005)  COMP-3.
03  IZ                  PIC S9(005)  COMP-3.
03  SRM-IDX             PIC S9(005)  COMP-3.
03  SRM-IDX2            PIC S9(005)  COMP-3.
03  KNM-IDX             PIC S9(005)  COMP-3.
03  KNM-IDX2            PIC S9(005)  COMP-3.
03  SRM-PTR             PIC S9(005)  COMP-3.
03  SRM-PTR2            PIC S9(005)  COMP-3.
03  KNM-PTR             PIC S9(005)  COMP-3.
03  KNM-PTR2            PIC S9(005)  COMP-3.
03  WK-IDX              PIC S9(005)  COMP-3.
03  WK-IDX2             PIC S9(005)  COMP-3.
03  WK-SRM-IDX          PIC S9(005)  COMP-3.
03  IX1                 PIC S9(005)  COMP-3.
03  IX2                 PIC S9(005)  COMP-3.
03  IX3                 PIC S9(005)  COMP-3.
03  IX4                 PIC S9(005)  COMP-3.
03  IX5                 PIC S9(005)  COMP-3.
03  IX8                 PIC S9(005)  COMP-3.
03  IX9                 PIC S9(005)  COMP-3.
03  IX6                 PIC S9(005)  COMP-3.
03  IX7                 PIC S9(005)  COMP-3.
03  DBHR-PTR            PIC S9(005)  COMP-3.
03  KIHON-HR-PTR        PIC S9(005)  COMP-3.
01  CNT-AREA.
03  SRM-NEW-CNT         PIC  S9(008).
03  SRM-INS-CNT         PIC  S9(008).
03  SRM-UPD-CNT         PIC  S9(008).
03  SRM-DEL-CNT         PIC  S9(008).
03  SRK-NEW-CNT         PIC  S9(008).
03  SRK-INS-CNT         PIC  S9(008).
03  SRK-UPD-CNT         PIC  S9(008).
03  SRK-DEL-CNT         PIC  S9(008).
03  SRK-MRG-CNT         PIC  S9(008).
03  WK-TRN-CNT          PIC  S9(010).
01  TRN-SQL.
03  FILLER   PIC  X(020)  VALUE  "SELECT              ".
03  FILLER   PIC  X(020)  VALUE  " rk.sya_id,         ".
03  FILLER   PIC  X(020)  VALUE  " rk.srtbl_no,       ".
03  FILLER   PIC  X(020)  VALUE  " rk.srfld_id,       ".
03  FILLER   PIC  X(020)  VALUE  " rk.srfld_oval,     ".
03  FILLER   PIC  X(020)  VALUE  " rk.srfld_nval,     ".
03  FILLER   PIC  X(021)  VALUE  " to_char(rk.lnk_date,".
03  FILLER   PIC  X(020)  VALUE  "     'YYYY/MM/DD'), ".
03  FILLER   PIC  X(020)  VALUE  " rk.status,         ".
03  FILLER   PIC  X(020)  VALUE  " rk.hr_no,          ".
03  FILLER   PIC  X(020)  VALUE  " rk.hrrk_kb,        ".
03  FILLER   PIC  X(020)  VALUE  " rk.trn_kb,         ".
03  FILLER   PIC  X(020)  VALUE  " rk.knm_seq,        ".
03  FILLER   PIC  X(020)  VALUE  " rk.entry_kb,       ".
03  FILLER   PIC  X(022)  VALUE  " NVL(rk.lnk_date_kb,1)".
03  FILLER   PIC  X(023)  VALUE  " FROM sr_jlnktrn_rk rk ".
03  FILLER   PIC  X(027)  VALUE  " WHERE rk.srtbl_no < 91000".
03  FILLER   PIC  X(024)  VALUE  " AND ((rk.syori_flg = 0 ".
03  PAST-JK-PAR           PIC X(280).
03  FUTURE-JK-PAR         PIC X(240).
03  FILLER   PIC  X(025)  VALUE  " ) OR (rk.syori_flg = 1))".
03  FILLER   PIC  X(024)  VALUE  " AND rk.restore_flg = 0 ".
03  FILLER   PIC  X(020)  VALUE  " AND EXISTS(        ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(020)  VALUE  " sr_jlnk_syain js   ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  "      = js.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  " AND js.par_id =    ".
03  WK-PAR-ID             PIC  X(003).
03  FILLER   PIC  X(001)  VALUE  ")".
03  FILLER   PIC  X(024)  VALUE  " ORDER BY 1,6,7,hatdate,".
03  FILLER   PIC  X(023)  VALUE  "8,9,2,11,3,rk.prc_date ".
01  SYORI-UPD-SQL.
03  FILLER   PIC  X(020)  VALUE  "UPDATE              ".
03  FILLER   PIC  X(022)  VALUE  " sr_jlnktrn_rk rk SET ".
03  FILLER   PIC  X(020)  VALUE  " syori_flg = 9,     ".
03  FILLER   PIC  X(016)  VALUE  " act_lnk_date = ".
03  FILLER   PIC  X(016)  VALUE  " to_date(rtrim('".
03  ACT-LNK-TIME             PIC  X(025).
03  FILLER   PIC  X(004)  VALUE  "'), ".
03  FILLER   PIC  X(025)  VALUE  "'YYYY/MM/DD HH24:MI:SS'),".
03  FILLER   PIC  X(020)  VALUE  " prc_date = sysdate ".
03  FILLER   PIC  X(026)  VALUE  " WHERE rk.srtbl_no =".
03  SYORI-UPD-TBL-NO      PIC X(005).
03  FILLER   PIC  X(024)  VALUE  " AND ((rk.syori_flg = 0 ".
03  PAST-UPD-JK-PAR       PIC X(280).
03  FUTURE-UPD-JK-PAR     PIC X(240).
03  FILLER   PIC  X(025)  VALUE  " ) OR (rk.syori_flg = 1))".
03  SYORI-JK-PAR            PIC X(124).
01  PAR-JK-SQL.
03  FILLER   PIC  X(020)  VALUE  " AND EXISTS(        ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(020)  VALUE  " sr_jlnk_syain js   ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  "      = js.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  " AND js.par_id =    ".
03  WK-PAR-ID2            PIC  X(003).
03  FILLER   PIC  X(001)  VALUE  ")".
01  PAST-JK-SQL.
03  FILLER   PIC  X(020)  VALUE  " AND ((EXISTS(      ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(011)  VALUE  " sr_hrinfo ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  "  = sya_id          ".
03  FILLER   PIC  X(022)  VALUE  " AND rk.hr_no = hr_no ".
03  FILLER   PIC  X(026)  VALUE  " AND rk.hrrk_kb = hrrk_kb ".
03  FILLER   PIC  X(020)  VALUE  " AND hatdate >=     ".
03  FILLER   PIC  X(020)  VALUE  "  (  to_date(rtrim('".
03  COMPARE-PAST-TIME             PIC  X(025).
03  FILLER   PIC  X(004)  VALUE  "'), ".
03  FILLER   PIC  X(027)  VALUE  "'YYYY/MM/DD HH24:MI:SS') - ".
03  JK-PAST-SUSPEND-DAYS   PIC X(003).
03  FILLER   PIC  X(007)  VALUE  "))) or ".
03  FILLER   PIC  X(019)  VALUE  "(rk.trn_kb >=2 AND ".
03  FILLER   PIC  X(016)  VALUE  " rk.trn_kb <=6))".
01  FUTURE-JK-SQL.
03  FILLER   PIC  X(020)  VALUE  " AND EXISTS(        ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(011)  VALUE  " sr_hrinfo ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  "  = sya_id          ".
03  FILLER   PIC  X(022)  VALUE  " AND rk.hr_no = hr_no ".
03  FILLER   PIC  X(026)  VALUE  " AND rk.hrrk_kb = hrrk_kb ".
03  FILLER   PIC  X(020)  VALUE  " AND hatdate <=     ".
03  FILLER   PIC  X(020)  VALUE  "  (  to_date(rtrim('".
03  COMPARE-FUTURE-TIME           PIC  X(025).
03  FILLER   PIC  X(004)  VALUE  "'), ".
03  FILLER   PIC  X(027)  VALUE  "'YYYY/MM/DD HH24:MI:SS') + ".
03  JK-FUTURE-SUSPEND-DAYS PIC X(003).
03  FILLER   PIC  X(002)  VALUE  "))".
01  RESTORE-UPD-SQL.
03  FILLER   PIC  X(020)  VALUE  "UPDATE              ".
03  FILLER   PIC  X(022)  VALUE  " sr_jlnktrn_rk rk SET ".
03  FILLER   PIC  X(020)  VALUE  " restore_flg = -1,  ".
03  FILLER   PIC  X(020)  VALUE  " prc_date = sysdate ".
03  FILLER   PIC  X(020)  VALUE  " WHERE rk.srtbl_no =".
03  RESTORE-UPD-TBL-NO    PIC X(005).
03  FILLER   PIC  X(022)  VALUE  " AND rk.syori_flg = 9 ".
03  FILLER   PIC  X(022)  VALUE  " AND rk.restore_flg=0 ".
03  FILLER   PIC  X(020)  VALUE  " AND EXISTS(        ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(020)  VALUE  " sr_jlnkhr_no jh    ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  jh.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  " AND    jh.hr_no    ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.hr_no    ".
03  FILLER   PIC  X(020)  VALUE  " AND    jh.hrrk_kb  ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.hrrk_kb  ".
03  FILLER   PIC  X(020)  VALUE  " AND jh.status = 3) ".
03  FILLER   PIC  X(020)  VALUE  " AND EXISTS(        ".
03  FILLER   PIC  X(020)  VALUE  " SELECT 1 FROM      ".
03  FILLER   PIC  X(020)  VALUE  " sr_jlnktrn_rk rk2  ".
03  FILLER   PIC  X(020)  VALUE  " WHERE  rk2.srtbl_no".
03  FILLER   PIC  X(020)  VALUE  "      = rk.srtbl_no ".
03  FILLER   PIC  X(020)  VALUE  " AND rk2.syori_flg=1".
03  FILLER   PIC  X(020)  VALUE  " AND rk2.trn_kb = 9 ".
03  FILLER   PIC  X(020)  VALUE  " AND    rk2.sya_id  ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.sya_id   ".
03  FILLER   PIC  X(020)  VALUE  " AND    rk2.hr_no   ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.hr_no    ".
03  FILLER   PIC  X(020)  VALUE  " AND    rk2.status  ".
03  FILLER   PIC  X(020)  VALUE  "      = rk.status)  ".
03  RESTORE-JK-PAR        PIC X(124).
01  PRS-TIME.
03  SLP-TIME            PIC  X(05) VALUE "20".
03  FILLER              PIC  X(01) VALUE X"00".
PROCEDURE DIVISION.
CNTL SECTION.
PERFORM  DISPLAY-TIME.
DISPLAY "***".
DISPLAY "*** PROGRAM START !!=> " C-PGMID " "DATE-NOW-TXT.
DISPLAY "*** PROGRAM VERSION => " C-VERSION.
DISPLAY "***".
PERFORM     INIT.
PERFORM     MAIN.
PERFORM     FINI.
PERFORM  DISPLAY-TIME.
DISPLAY "***".
DISPLAY "*** PROGRAM END !!  => " C-PGMID " "DATE-NOW-TXT.
DISPLAY "***".
STOP        RUN.

INIT SECTION.
INIT-RTN.
PERFORM  DISPLAY-TIME.
DISPLAY  "================ INIT START ================ "
TIME-NOW-TXT.
ACCEPT  DBNAME          FROM  ARGUMENT-VALUE.
ACCEPT  MENU-ID         FROM  ARGUMENT-VALUE.
ACCEPT  JOB-ID          FROM  ARGUMENT-VALUE.
ACCEPT  SEC-JOBID       FROM  ARGUMENT-VALUE.
ACCEPT  PAR-ID-STR      FROM  ARGUMENT-VALUE.
ACCEPT  P-SIM-KB        FROM  ARGUMENT-VALUE.
MOVE  FUNCTION NUMVAL(P-SIM-KB)   TO  SIM-KB.
INITIALIZE  WS-SRLNKTRN-REC.
INITIALIZE  WORK-AREA  IDX-AREA  FLG-AREA  CNT-AREA.
MOVE  FUNCTION NUMVAL(PAR-ID-STR)   TO  PAR-ID.
DISPLAY "  > PAR-ID      = " PAR-ID.
MOVE PAR-ID TO WK-VAL-DECEDT.
PERFORM SET-NUM-TO-CHR.
MOVE WK-VAL-CHR  TO   WK-PAR-ID
WK-PAR-ID2.
MOVE     0  TO  CNT-DBHR
CNT-KIHON-HR.
MOVE     0  TO  CNT-DBTRNRK.
INITIALIZE      DBHR-REC
KIHON-HR-REC.
INITIALIZE      DBTRNRK-REC.
DISPLAY " >> DB CONNECT  START ! <<".
EXEC  SQL  WHENEVER SQLERROR STOP  # END-EXEC.
CALL "DBConnect" USING DBNAME.
IF RETURN-CODE NOT = ZERO

END-IF.
EXEC  SQL  SET LOCKMODE SESSION
WHERE LEVEL = PAGE,
READLOCK    = NOLOCK
# END-EXEC.
EXEC  SQL  COMMIT                  # END-EXEC.
DISPLAY " >> DB CONNECT  END !   <<".
DISPLAY " >> DB CONNECT2 START ! <<".
EXEC SQL WHENEVER SQLERROR  DO PERFORM SUBCOM-SQLERROR
# END-EXEC.
MOVE C-PGMID                    TO SUBCOM-PGM-ID.
MOVE DBNAME                     TO SUBCOM-CSPSID.
MOVE FUNCTION NUMVAL(SEC-JOBID) TO SUBCOM-QUE-ID.
PERFORM SUBCOM-INIT.
DISPLAY " >> DB CONNECT2 END   ! <<".
PERFORM  SRJLNKCTRL-GET.
IF  SIM-KB  = 1
AND USE-SIM = 1
MOVE  1  TO  DOING-SIM
ELSE
MOVE  0  TO  DOING-SIM
END-IF.
IF  SIM-KB  = 1
AND USE-SIM = 0
DISPLAY "*** é?žå®Ÿè¡Œãƒ¢ãƒ¼ãƒ‰ã?«ã?¤ã??å‡¦ç?†çµ‚äº† ***"
DISPLAY "================ INIT END   ================ "
TIME-NOW-TXT

END-IF.
PERFORM  VER002-SET.
IF  PAR-ID > 0
EXEC  SQL
SELECT  para_cnt,
interval_time
INTO    :PR-CNT,
:PR-TIME
FROM    sr_parallelcontr
WHERE   menu_id       =   :MENU-ID
AND     job_id        =   :JOB-ID
# END-EXEC
IF  PR-CNT   NOT  NUMERIC
MOVE  1   TO  PR-CNT
ELSE
EVALUATE  TRUE
WHEN  PR-CNT   <=  0
MOVE   1   TO  PR-CNT
WHEN  PR-CNT    >  5
MOVE   5   TO  PR-CNT
END-EVALUATE
END-IF
DISPLAY "  > PR-CNT      = " PR-CNT
DISPLAY "  > PR-TIME     = " PR-TIME
END-IF.
PERFORM  DISPLAY-TIME.
DISPLAY  "================ INIT END   ================ "
TIME-NOW-TXT.
INIT-EXT.
EXIT.
VER002-SET SECTION.
VER002-SET-RTN.
EXEC  SQL
UPDATE  sr_jlnk_rk  SET
VER_002 = :C-VERSION
WHERE   seq_no = (SELECT max(seq_no)
FROM   sr_jlnk_rk)
AND     par_id = 0
AND     status = 2
AND     ver_002 is null
# END-EXEC.
IF PAR-ID > 0
EXEC SQL
INSERT INTO SR_JLNK_RK
(
SEQ_NO,
PAR_ID,
LNKTBL_NO,
ACT_KB,
STIME,
STATUS,
LAST_TIME,
LAST_LNK_TIME,
START_DATE,
END_DATE,
LNK_KB,
LNKFLG01,
LNKFLG02,
LNKFLG03,
LNKFLG04,
LNKFLG05,
LNKFLG06,
LNKFLG07,
LNKFLG08,
LNKFLG09,
LNKFLG10,
PAST_LNK_KB,
FUTURE_LNK_KB,
PAST_SUSPEND_DAYS,
FUTURE_SUSPEND_DAYS,
VER_001,
VER_002,
VER_003
)
SELECT SEQ_NO,
:PAR-ID,
LNKTBL_NO,
ACT_KB,
sysdate,
STATUS,
LAST_TIME,
LAST_LNK_TIME,
START_DATE,
END_DATE,
LNK_KB,
LNKFLG01,
LNKFLG02,
LNKFLG03,
LNKFLG04,
LNKFLG05,
LNKFLG06,
LNKFLG07,
LNKFLG08,
LNKFLG09,
LNKFLG10,
PAST_LNK_KB,
FUTURE_LNK_KB,
PAST_SUSPEND_DAYS,
FUTURE_SUSPEND_DAYS,
VER_001,
VER_002,
VER_003
FROM   sr_jlnk_rk
WHERE  seq_no = (SELECT max(seq_no)
FROM   sr_jlnk_rk)
AND    par_id = 0
AND    status = 2
# END-EXEC
END-IF.
EXEC  SQL  COMMIT                  # END-EXEC.
VER002-SET-EXT.
EXIT.
SRJLNKCTRL-GET SECTION.
SRJLNKCTRL-GET-RTN.
INITIALIZE  SRJLNKCTRL-REC.
EXEC  SQL
SELECT  past_lnk_kb        ,
future_lnk_kb      ,
past_suspend_days  ,
future_suspend_days,
lnkflg06
INTO   :PAST-LNK-KB        ,
:FUTURE-LNK-KB      ,
:PAST-SUSPEND-DAYS  ,
:FUTURE-SUSPEND-DAYS,
:LNK-RESTORE
FROM    sr_jlnkctrl
WHERE   lnktbl_no = 90000
# END-EXEC.
EXEC  SQL
SELECT VAL
INTO  :USE-SIM
FROM   SR_JLNK_INFO_FLG
WHERE  NAME = 'use_sim'
# END-EXEC.
SRJLNKCTRL-GET-EXT.
EXIT.
MAIN SECTION.
MAIN-RTN.
PERFORM  DISPLAY-TIME.
DISPLAY  "================ MAIN START ================ "
TIME-NOW-TXT.
IF  SIM-KB  = 1
AND USE-SIM = 0
DISPLAY "*** é?žå®Ÿè¡Œãƒ¢ãƒ¼ãƒ‰ã?«ã?¤ã??å‡¦ç?†çµ‚äº† ***"

END-IF.
PERFORM  SRLNKTRN-DEL.
MOVE  SPACE  TO  PAST-JK-PAR
FUTURE-JK-PAR
SYORI-JK-PAR
RESTORE-JK-PAR.
EXEC  SQL
SELECT  to_char(sysdate, 'YYYY/MM/DD HH24:MI:SS')
INTO   :WK-PRC-DATE
FROM    DUAL
# END-EXEC.
IF PAST-LNK-KB <> 0 THEN
MOVE  PAST-SUSPEND-DAYS  TO  JK-PAST-SUSPEND-DAYS
MOVE  WK-PRC-DATE        TO  COMPARE-PAST-TIME
MOVE  PAST-JK-SQL        TO  PAST-JK-PAR
MOVE  PAST-JK-SQL        TO  PAST-UPD-JK-PAR
END-IF.
IF FUTURE-LNK-KB <> 0 THEN
MOVE  FUTURE-SUSPEND-DAYS  TO  JK-FUTURE-SUSPEND-DAYS
MOVE  WK-PRC-DATE          TO  COMPARE-FUTURE-TIME
MOVE  FUTURE-JK-SQL        TO  FUTURE-JK-PAR
MOVE  FUTURE-JK-SQL        TO  FUTURE-UPD-JK-PAR
END-IF.
IF PAR-ID > 0
MOVE PAR-JK-SQL  TO SYORI-JK-PAR
RESTORE-JK-PAR
END-IF.
IF PAST-LNK-KB = 0
MOVE "1900/01/01 00:00:00" TO WK-PAST-DATE
ELSE
MOVE WK-PRC-DATE           TO WK-PAST-DATE
END-IF.
IF FUTURE-LNK-KB = 0
MOVE "2382/12/31 23:59:59" TO WK-FUTURE-DATE
ELSE
MOVE WK-PRC-DATE           TO WK-FUTURE-DATE
END-IF.
MOVE  TRN-SQL  TO  SQL-PAR.
DISPLAY " ---TRN-SQL--- "  SQL-PAR.
EXEC  SQL  PREPARE  srjlnktrncsr_S1  FROM  :SQL-PAR
# END-EXEC.
EXEC  SQL  DECLARE  srjlnktrncsr  CURSOR  FOR srjlnktrncsr_S1
# END-EXEC.
EXEC  SQL  OPEN  srjlnktrncsr  FOR  READONLY # END-EXEC.
EXEC  SQL  DECLARE restoretrnrkcsr  CURSOR FOR
SELECT  sya_id,
srtbl_no,
srfld_id,
srfld_oval,
srfld_nval,
to_char(lnk_date,'YYYY/MM/DD'),
rk.status,
hr_no,
hrrk_kb,
trn_kb,
knm_seq,
entry_kb
FROM sr_jlnktrn_rk rk
WHERE srtbl_no <  91000
AND  trn_kb = 9
AND  syori_flg = 1
AND  exists (SELECT  0 FROM sr_jlnk_syain js
WHERE rk.sya_id = js.sya_id
AND   js.par_id = :PAR-ID)
ORDER BY 1,act_lnk_date desc,6 desc,7 desc
,hatdate desc,8 desc,9 desc,2,11,3
# END-EXEC.
EXEC  SQL  OPEN  restoretrnrkcsr  FOR  READONLY # END-EXEC.
PERFORM  SRLNKTRN-FET.
IF LNKSYAIN-EOF-FLG = 0 THEN
MOVE  SRT-SYA-ID    TO  OLD-SYA-ID
MOVE  SRT-LNK-DATE  TO  OLD-LNK-DATE
MOVE  SRT-HR-NO     TO  OLD-HR-NO
MOVE  SRT-HRRK-KB   TO  OLD-HRRK-KB
MOVE  SRT-STATUS    TO  OLD-STATUS
MOVE  SRT-TRN-KB    TO  OLD-TRN-KB
MOVE  SRT-LNK-DATE-KB TO  OLD-LNK-DATE-KB
PERFORM  DISPLAY-TIME
DISPLAY  " >> ãƒ¡ã‚¤ãƒ³ãƒ«ãƒ¼ãƒ— START << " TIME-NOW-TXT
PERFORM  UNTIL  LNKSYAIN-EOF-FLG  =  1
PERFORM  SRLNKTRN-SET
PERFORM  SRMST-WRITE
IF TRN-KB < 9
PERFORM  TRNRK-OLD-UPD-SET
ELSE
PERFORM  TRNRK-NEW-UPD-SET
END-IF
INITIALIZE    WS-SRLNKTRN-REC
PERFORM  DATA-ADJUST-KENM
END-PERFORM
PERFORM  DISPLAY-TIME
DISPLAY  " >> ãƒ¡ã‚¤ãƒ³ãƒ«ãƒ¼ãƒ— END   << " TIME-NOW-TXT
IF  CNT-DBHR  > 0
PERFORM  DBHR-UPD
END-IF
END-IF.
EXEC  SQL  CLOSE  srjlnktrncsr  # END-EXEC.
EXEC  SQL  CLOSE  restoretrnrkcsr   # END-EXEC.
IF  CNT-DBTRNRK  > 0  THEN
PERFORM  DBTRNRK-UPD
END-IF.
PERFORM  DISPLAY-TIME.
DISPLAY  "================ MAIN END   ================ "
TIME-NOW-TXT.
MAIN-EXT.
EXIT.
SRLNKTRN-DEL SECTION.
SRLNKTRN-DEL-RTN.
PERFORM  DISPLAY-TIME.
DISPLAY  " >> SRLNKTRN-DEL START << " TIME-NOW-TXT.
EXEC  SQL
DELETE FROM  sr_jlnktrn_rk rk
WHERE NOT EXISTS
(
SELECT 0 FROM sr_hrinfo hi
WHERE  hi.hr_no = rk.hr_no
AND   hi.hrrk_kb = rk.hrrk_kb
AND   hi.sya_id = rk.sya_id
)
AND   rk.srtbl_no < 91000
AND   rk.hr_no > 0
AND   rk.syori_flg < 9
AND   rk.restore_flg = 0
AND   exists (SELECT  0 FROM sr_jlnk_syain js
WHERE rk.sya_id = js.sya_id
AND   js.par_id = :PAR-ID)
# END-EXEC.
PERFORM  DISPLAY-TIME.
DISPLAY  "  > SRLNKTRN-DEL ãƒ»ãƒ»ãƒ»<  " TIME-NOW-TXT.
EXEC  SQL
DELETE FROM  sr_jlnktrn_rk rk
WHERE  trn_kb = 6
AND    syori_flg < 9
AND    EXISTS(SELECT 0
FROM sr_jlnk_kmk_setup_rk kk
WHERE kk.srtbl_no = rk.srtbl_no
AND   kk.srfld_id = rk.srfld_id
AND   rk.lnk_date
between kk.sdate and kk.edate
AND   kk.syori_flg = 0)
AND    exists (SELECT  0 FROM sr_jlnk_syain js
WHERE rk.sya_id = js.sya_id
AND   js.par_id = :PAR-ID)
# END-EXEC.
PERFORM  DISPLAY-TIME.
DISPLAY  " >> SRLNKTRN-DEL END   << " TIME-NOW-TXT.
SRLNKTRN-DEL-EXT.
EXIT.
SRLNKTRN-FET SECTION.
SRLNKTRN-FET-RTN.
INITIALIZE  SRLNKTRN-REC.
IF  RESTORE-EOF-FLG = 0
EXEC  SQL  FETCH restoretrnrkcsr INTO :SRT-SYA-ID   ,
:SRT-SRTBL-NO    ,
:SRT-SRFLD-ID    ,
:SRT-SRFLD-OVAL  ,
:SRT-SRFLD-NVAL  ,
:SRT-LNK-DATE    ,
:SRT-STATUS      ,
:SRT-HR-NO       ,
:SRT-HRRK-KB     ,
:SRT-TRN-KB      ,
:SRT-KNM-SEQ     ,
:SRT-ENTRY-KB
# END-EXEC
IF  SQLCODE  <>  0  THEN
MOVE  1  TO  RESTORE-EOF-FLG
END-IF
END-IF
IF  RESTORE-EOF-FLG = 1
IF  CNT-KIHON-HR  > 0
PERFORM  KIHON-HR-UPD
END-IF
EXEC  SQL  FETCH srjlnktrncsr INTO :SRT-SYA-ID      ,
:SRT-SRTBL-NO    ,
:SRT-SRFLD-ID    ,
:SRT-SRFLD-OVAL  ,
:SRT-SRFLD-NVAL  ,
:SRT-LNK-DATE    ,
:SRT-STATUS      ,
:SRT-HR-NO       ,
:SRT-HRRK-KB     ,
:SRT-TRN-KB      ,
:SRT-KNM-SEQ     ,
:SRT-ENTRY-KB    ,
:SRT-LNK-DATE-KB
# END-EXEC
IF  SQLCODE  <>  0  THEN
MOVE  9999999999 TO  SRT-SYA-ID
MOVE  1          TO  LNKSYAIN-EOF-FLG
END-IF
END-IF.
ADD  1  TO  WK-TRN-CNT.
IF  WK-TRN-CNT = 2000 THEN
PERFORM  DISPLAY-TIME
DISPLAY "    â€¦ å‡¦ç?†ä¸­ â€¦          " TIME-NOW-TXT
MOVE  0  TO  WK-TRN-CNT
END-IF.
IF  SRT-TRN-KB = 9
MOVE  CNT-KIHON-HR  TO  KIHON-HR-PTR
PERFORM  UNTIL  (KIHON-HR-PTR = 0)
OR SRT-SYA-ID <> KIHON-HR-SYA-ID(KIHON-HR-PTR)
IF (SRT-SYA-ID   = KIHON-HR-SYA-ID(CNT-KIHON-HR))  AND
(SRT-HR-NO    = KIHON-HR-HR-NO(CNT-KIHON-HR))   AND
(SRT-HRRK-KB  = KIHON-HR-HRRK-KB(CNT-KIHON-HR))

END-IF
SUBTRACT  1  FROM  KIHON-HR-PTR
END-PERFORM
IF  (CNT-KIHON-HR   >=  KIHON-HR-MAX)
AND (SRT-SYA-ID <>  KIHON-HR-SYA-ID(CNT-KIHON-HR))
PERFORM  KIHON-HR-UPD
END-IF
COMPUTE  CNT-KIHON-HR   =  CNT-KIHON-HR   +  1
MOVE  SRT-SYA-ID      TO  KIHON-HR-SYA-ID(CNT-KIHON-HR)
MOVE  SRT-HR-NO       TO  KIHON-HR-HR-NO(CNT-KIHON-HR)
MOVE  SRT-HRRK-KB     TO  KIHON-HR-HRRK-KB(CNT-KIHON-HR)
ELSE
IF  SRT-TRN-KB <= 1
MOVE  CNT-DBHR  TO  DBHR-PTR
PERFORM  UNTIL  (DBHR-PTR = 0)
OR SRT-SYA-ID <> DB-HR-SYA-ID(DBHR-PTR)
IF (SRT-SYA-ID   = DB-HR-SYA-ID(CNT-DBHR))  AND
(SRT-HR-NO    = DB-HR-HR-NO(CNT-DBHR))   AND
(SRT-HRRK-KB  = DB-HR-HRRK-KB(CNT-DBHR))

END-IF
SUBTRACT  1  FROM  DBHR-PTR
END-PERFORM
IF  (CNT-DBHR   >=  DBHR-MAX)
AND (SRT-SYA-ID <>  DB-HR-SYA-ID(CNT-DBHR))
PERFORM  DBHR-UPD
END-IF
COMPUTE  CNT-DBHR   =  CNT-DBHR   +  1
MOVE  SRT-SYA-ID      TO  DB-HR-SYA-ID(CNT-DBHR)
MOVE  SRT-HR-NO       TO  DB-HR-HR-NO(CNT-DBHR)
MOVE  SRT-HRRK-KB     TO  DB-HR-HRRK-KB(CNT-DBHR)
END-IF
END-IF.
SRLNKTRN-FET-EXT.
EXIT.
SRLNKTRN-SET SECTION.
SRLNKTRN-SET-RTN.
IF ( SRT-SYA-ID    =  OLD-SYA-ID   )  AND
( SRT-LNK-DATE  =  OLD-LNK-DATE )  AND
( SRT-STATUS    =  OLD-STATUS   )  AND
( SRT-HR-NO     =  OLD-HR-NO    )  AND
( SRT-HRRK-KB   =  OLD-HRRK-KB  )  AND
(
((SRT-TRN-KB < 9) AND (OLD-TRN-KB < 9))
OR
((SRT-TRN-KB = 9) AND (OLD-TRN-KB = 9))
)
IF  (CNT-LNKTRN  = 0)
OR  ((SRT-SRTBL-NO  <>  WS-SRTBL-NO(CNT-LNKTRN))
OR
(SRT-SRFLD-ID  <>  WS-SRFLD-ID(CNT-LNKTRN))
OR
(SRT-KNM-SEQ   <>  WS-KNM-SEQ(CNT-LNKTRN)))
ADD   1                 TO  CNT-LNKTRN
END-IF
MOVE  SRT-SRTBL-NO      TO  WS-SRTBL-NO(CNT-LNKTRN)
MOVE  SRT-SRFLD-ID      TO  WS-SRFLD-ID(CNT-LNKTRN)
MOVE  SRT-SRFLD-OVAL    TO  WS-SRFLD-OVAL(CNT-LNKTRN)
WS-SRFLD-OVAL-J(CNT-LNKTRN)
MOVE  SRT-SRFLD-NVAL    TO  WS-SRFLD-NVAL(CNT-LNKTRN)
WS-SRFLD-NVAL-J(CNT-LNKTRN)
MOVE  SRT-TRN-KB        TO  WS-TRN-KB(CNT-LNKTRN)
MOVE  SRT-KNM-SEQ       TO  WS-KNM-SEQ(CNT-LNKTRN)
MOVE  SRT-LNK-DATE      TO  WS-LNK-DATE(CNT-LNKTRN)
MOVE  SRT-HR-NO         TO  WS-HR-NO(CNT-LNKTRN)
MOVE  SRT-HRRK-KB       TO  WS-HRRK-KB(CNT-LNKTRN)
MOVE  SRT-STATUS        TO  WS-STATUS(CNT-LNKTRN)
MOVE  SRT-ENTRY-KB      TO  WS-ENTRY-KB(CNT-LNKTRN)
MOVE  0                 TO  WS-SYORI-FLG(CNT-LNKTRN)
PERFORM SRLNKTRN-FET

ELSE
MOVE  OLD-SYA-ID      TO  SYA-ID
MOVE  OLD-LNK-DATE    TO  LNK-DATE
MOVE  OLD-HR-NO       TO  HR-NO
MOVE  OLD-HRRK-KB     TO  HRRK-KB
MOVE  OLD-STATUS      TO  WK-STATUS
MOVE  OLD-TRN-KB      TO  TRN-KB
MOVE  OLD-LNK-DATE-KB TO  LNK-DATE-KB
END-IF.
MOVE  SRT-SYA-ID    TO  OLD-SYA-ID.
MOVE  SRT-LNK-DATE  TO  OLD-LNK-DATE.
MOVE  SRT-HR-NO     TO  OLD-HR-NO.
MOVE  SRT-HRRK-KB   TO  OLD-HRRK-KB.
MOVE  SRT-STATUS    TO  OLD-STATUS.
MOVE  SRT-TRN-KB    TO  OLD-TRN-KB.
MOVE  SRT-LNK-DATE-KB TO  OLD-LNK-DATE-KB.
SRLNKTRN-SET-EXT.
EXIT.
SRMST-WRITE SECTION.
SRMST-WRITE-RTN.
PERFORM  SRMST-GET.
PERFORM  SRKNM-GET.
INITIALIZE CP-SRMST-REC.
IF  CNT-SRMST  =  0 THEN
MOVE  1  TO  SRM-IDX
MOVE  0  TO  KNM-IDX
MOVE  1  TO  CNT-SRMST
MOVE  "2382/12/31" TO LNK-EDATE

MOVE  1  TO  KNM-IDX
PERFORM  SRMST-NEW
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(1)
PERFORM  SRKNM-NEW
ADD 1 TO KNM-IDX
END-PERFORM

END-IF.
MOVE  1  TO  SRM-PTR.
PERFORM  UNTIL SRM-PTR > CNT-SRMST
IF  ((TRN-KB < 9) AND (SRM-EDATE(SRM-PTR) >= LNK-DATE))
OR  (SRM-SDATE(SRM-PTR) = LNK-DATE)
MOVE  SRMST(SRM-PTR)  TO  CP-SRMST-REC
EXIT PERFORM
END-IF
ADD  1  TO  SRM-PTR
END-PERFORM.
IF SRM-STATUS(SRM-PTR) = 0
OR TRN-KB = 9
MOVE  1  TO  IS-STS0-FLG
ELSE
MOVE  1  TO  IX6
PERFORM  UNTIL IX6 > CNT-SRKNM(SRM-PTR)
MOVE  1  TO  SRK-IS-STS0-FLG(SRM-PTR,IX6)
ADD   1  TO  IX6
END-PERFORM
END-IF.
IF  TRN-KB < 9
COMPUTE  SRM-PTR2 = SRM-PTR
PERFORM  UNTIL SRM-PTR2 > CNT-SRMST
OR SRM-SDATE(SRM-PTR2) > LNK-DATE
ADD  1  TO  SRM-PTR2
END-PERFORM
COMPUTE  SRM-PTR2 = SRM-PTR2 - 1
IF  SRM-PTR < SRM-PTR2
MOVE  1  TO  IX6
PERFORM  UNTIL IX6 > CNT-SRKNM(SRM-PTR2)
MOVE  1  TO  IX7
PERFORM  UNTIL IX7 > CNT-SRKNM(SRM-PTR)
IF SRK-KNM-SEQ(SRM-PTR2,IX6)
= SRK-KNM-SEQ(SRM-PTR,IX7)
EXIT PERFORM
END-IF
ADD  1  TO  IX7
END-PERFORM
IF IX7 > CNT-SRKNM(SRM-PTR)
ADD  1  TO  CNT-SRKNM(SRM-PTR)
MOVE SRKNM(SRM-PTR2,IX6)
TO SRKNM(SRM-PTR,CNT-SRKNM(SRM-PTR))
MOVE 1 TO
SRK-IS-STS0-FLG(SRM-PTR,CNT-SRKNM(SRM-PTR))
END-IF
ADD  1  TO  IX6
END-PERFORM
MOVE  SRMST(SRM-PTR)  TO  CP-SRMST-REC
END-IF
END-IF.
MOVE  0  TO  SRM-EQUAL-DATE.
IF  SRM-SDATE(1) > LNK-DATE
MOVE  CNT-SRMST  TO  IX4
PERFORM  UNTIL IX4 < 1
COMPUTE  IX5  = IX4 + 1
MOVE  SRMST(IX4)  TO  SRMST(IX5)
COMPUTE  IX4  = IX4 - 1
END-PERFORM
COMPUTE  CNT-SRMST = CNT-SRMST + 1
INITIALIZE SRMST(1)
MOVE  SRMST(1)  TO  CP-SRMST-REC
MOVE  1  TO  SRM-IDX
KNM-IDX
PERFORM  SRMST-SET-VALUE
MOVE  -1  TO  WK-ADD-DAYS
MOVE  SRM-SDATE(2)  TO  WK-DATE
PERFORM ADD-XDAYS
MOVE  WK-DATE  TO  LNK-EDATE
PERFORM  SRMST-NEW
PERFORM  SRKNM-NEW
MOVE  2  TO  SRM-PTR
END-IF.
MOVE  SRM-PTR  TO  SRM-IDX.
PERFORM  UNTIL  SRM-IDX  >  CNT-SRMST
MOVE  0        TO  KNM-IDX
PERFORM  WITH TEST AFTER UNTIL KNM-IDX >= CNT-SRKNM(SRM-IDX)
ADD  1  TO  KNM-IDX
MOVE  SRM-IDX  TO  WK-IDX
PERFORM  UNTIL WK-IDX <= 0
IF  SRM-SDATE(WK-IDX) < SRM-SDATE(SRM-IDX)
AND SRM-STATUS(WK-IDX) = 0
EXIT PERFORM
END-IF
SUBTRACT  1  FROM  WK-IDX
END-PERFORM
IF  SRM-SDATE(SRM-IDX) = LNK-DATE
MOVE  1  TO  SRM-EQUAL-DATE
COMPUTE WK-IDX2 = SRM-IDX + 1
IF  (WK-IDX2 <= CNT-SRMST)
AND (WK-STATUS = 1)
IF  SRM-SDATE(WK-IDX2) = SRM-SDATE(SRM-IDX)
MOVE SRMST(WK-IDX2) TO  CP-SRMST-REC
EXIT PERFORM
END-IF
END-IF
END-IF
IF  (WK-STATUS = 1)
AND (SRM-STATUS(SRM-IDX) = 0)
AND (SRM-SDATE(SRM-IDX)  < LNK-DATE)
COMPUTE WK-IDX2 = SRM-IDX + 1
PERFORM  UNTIL WK-IDX2 > CNT-SRMST
IF  (SRM-STATUS(WK-IDX2) = 1)
AND (SRM-SDATE(WK-IDX2)  = LNK-DATE)
MOVE SRMST(WK-IDX2) TO  CP-SRMST-REC
EXIT PERFORM
END-IF
COMPUTE WK-IDX2 = WK-IDX2 + 1
END-PERFORM
IF  WK-IDX2 <= CNT-SRMST
EXIT PERFORM
END-IF
END-IF
IF  (WK-STATUS = 1)
AND (SRM-STATUS(SRM-IDX) = 1)
AND (SRM-SDATE(SRM-IDX) <> LNK-DATE)
EXIT PERFORM
END-IF
COMPUTE  WK-IDX2  = SRM-IDX - 1
PERFORM  UNTIL WK-IDX2 <= 0
IF  SRM-STATUS(WK-IDX2) = 0
EXIT PERFORM
END-IF
SUBTRACT  1  FROM  WK-IDX2
END-PERFORM
IF  (SRM-SDATE(SRM-IDX) < LNK-DATE)
AND (SRM-IDX > SRM-PTR)
AND (WK-STATUS = 1) THEN
MOVE  SRMST(SRM-IDX)  TO  CP-SRMST-REC
END-IF
IF  (WK-STATUS = 1)
AND (SRM-SDATE(SRM-IDX)  >  LNK-DATE)
AND (IS-STS0-FLG = 1) THEN
EXIT PERFORM
END-IF
MOVE  0  TO  SAME-DATA-FLG
IF  TRN-KB < 9
PERFORM  SRMST-SET-VALUE
IF  (CNT-SRKNM(SRM-IDX) = KNM-IDX
OR CNT-SRKNM(SRM-IDX) =0)
AND WK-IDX2 > 0
AND SRM-STATUS(SRM-IDX) = 1
INITIALIZE  SRMST-COMPARE-REC
MOVE SRMST(WK-IDX2)  TO SRMST-COMPARE(1)
MOVE SRMST(SRM-IDX) TO SRMST-COMPARE(2)
PERFORM  VARYING  IX  FROM  1  BY  1
UNTIL  IX  >  COM-CNT-SRKNM(1)
MOVE 0 TO COM-SRK-STATUS(1, IX)
COM-SRK-STATUS(2, IX)
COM-SRK-INSERT-FLG(1, IX)
COM-SRK-INSERT-FLG(2, IX)
COM-INSERT-FLG(1, IX)
COM-INSERT-FLG(2, IX)
COM-IS-STS0-FLG(1, IX)
COM-IS-STS0-FLG(2, IX)
END-PERFORM
IF  COM-SONOTA(1) = COM-SONOTA(2)
PERFORM  SRMST-MERGE
END-IF
END-IF
ELSE
IF  SRM-EQUAL-DATE = 1
PERFORM  SRMST-SET-DEL
IF  CNT-SRKNM(SRM-IDX)  >= KNM-IDX
AND SRK-K-SR-SYZ-CD(SRM-IDX,KNM-IDX)   = SPACE
AND SRK-K-GENERAL-CD01(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD02(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD03(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD04(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD05(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD06(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD07(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD08(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD09(SRM-IDX,KNM-IDX)= SPACE
AND SRK-K-GENERAL-CD10(SRM-IDX,KNM-IDX)= SPACE
AND ((SRM-STATUS(SRM-IDX) = WK-STATUS)
OR (WK-STATUS = 0))
MOVE SRM-STATUS(SRM-IDX)  TO  TGT-STATUS
PERFORM  SRKNM-DEL
MOVE  KNM-IDX  TO  IX8
PERFORM  UNTIL IX8 = CNT-SRKNM(SRM-IDX)
COMPUTE IX9 = IX8 + 1
MOVE  SRKNM(SRM-IDX,IX9)
TO  SRKNM(SRM-IDX,IX8)
MOVE  CSRKNM(IX9)
TO  CSRKNM(IX8)
ADD  1  TO  IX8
END-PERFORM
INITIALIZE SRKNM(SRM-IDX,CNT-SRKNM(SRM-IDX))
SUBTRACT  1  FROM  CNT-SRKNM(SRM-IDX)
SUBTRACT  1  FROM  KNM-IDX
END-IF
IF  (CNT-SRKNM(SRM-IDX) = KNM-IDX
OR CNT-SRKNM(SRM-IDX) =0)
AND WK-IDX2 > 0
INITIALIZE  SRMST-COMPARE-REC
MOVE SRMST(WK-IDX2) TO SRMST-COMPARE(1)
MOVE SRMST(SRM-IDX) TO SRMST-COMPARE(2)
PERFORM  VARYING  IX  FROM  1  BY  1
UNTIL  IX  >  COM-CNT-SRKNM(1)
MOVE 0 TO COM-SRK-STATUS(1, IX)
COM-SRK-STATUS(2, IX)
COM-SRK-INSERT-FLG(1, IX)
COM-SRK-INSERT-FLG(2, IX)
COM-INSERT-FLG(1, IX)
COM-INSERT-FLG(2, IX)
COM-IS-STS0-FLG(1, IX)
COM-IS-STS0-FLG(2, IX)
END-PERFORM
IF  COM-SONOTA(1) = COM-SONOTA(2)
PERFORM  SRMST-MERGE
END-IF
END-IF
END-IF
END-IF
END-PERFORM
INITIALIZE  SRMST-COMPARE-REC
MOVE CP-SRMST-REC   TO SRMST-COMPARE(1)
MOVE SRMST(SRM-IDX) TO SRMST-COMPARE(2)
PERFORM  VARYING  IX  FROM  1  BY  1
UNTIL  IX  >  COM-CNT-SRKNM(1)
MOVE 0 TO COM-SRK-STATUS(1, IX)
COM-SRK-STATUS(2, IX)
COM-SRK-INSERT-FLG(1, IX)
COM-SRK-INSERT-FLG(2, IX)
COM-INSERT-FLG(1, IX)
COM-INSERT-FLG(2, IX)
COM-IS-STS0-FLG(1, IX)
COM-IS-STS0-FLG(2, IX)
END-PERFORM
IF  COM-SONOTA(1) = COM-SONOTA(2)
MOVE  1  TO  SAME-DATA-FLG
END-IF
IF  SAME-DATA-FLG = 0
IF  (SRM-SDATE(SRM-IDX)  <  LNK-DATE) THEN
IF  WK-STATUS = 1 THEN
IF (SRM-IDX >= CNT-SRMST) THEN
IF (SRM-STATUS(SRM-IDX) =  0)
OR (IS-STS0-FLG = 0 ) THEN
PERFORM  SRMST-INS
END-IF
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
IF (SRK-STATUS(SRM-IDX,KNM-IDX) =  0)
OR (SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX) = 1)
PERFORM  SRKNM-INS
END-IF
ADD 1 TO KNM-IDX
END-PERFORM
ELSE
PERFORM  VARYING  WK-SRM-IDX  FROM  SRM-IDX
BY  1  UNTIL  WK-SRM-IDX  >  CNT-SRMST
IF SRM-SDATE(WK-SRM-IDX) = LNK-DATE THEN
EXIT PERFORM
END-IF
END-PERFORM
IF WK-SRM-IDX > CNT-SRMST THEN
IF (SRM-STATUS(SRM-IDX) =  0)
OR (IS-STS0-FLG = 0 ) THEN
PERFORM  SRMST-INS
END-IF
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
IF (SRK-STATUS(SRM-IDX,KNM-IDX) =  0)
OR (SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX) = 1)
PERFORM  SRKNM-INS
END-IF
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
END-IF
ELSE
IF  SRM-STATUS(SRM-IDX) =  0 THEN
PERFORM  SRMST-INS
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-INS
ADD 1 TO KNM-IDX
END-PERFORM
ELSE
IF IS-STS0-FLG = 0 THEN
PERFORM  SRMST-INS
MOVE  1  TO  IS-STS0-FLG
END-IF
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
IF (SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX) = 1)
PERFORM  SRKNM-INS
MOVE 0 TO SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX)
END-IF
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
END-IF
ELSE
IF  (SRM-SDATE(SRM-IDX)  =  LNK-DATE) THEN
IF  WK-STATUS = 1 THEN
IF  SRM-STATUS(SRM-IDX) =  0 THEN
IF  (SRM-IDX >= CNT-SRMST)
OR  (SRM-SDATE(SRM-IDX + 1) > LNK-DATE) THEN
PERFORM  SRMST-INS
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX
> CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-INS
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
ELSE
MOVE SRM-STATUS(SRM-IDX)  TO  TGT-STATUS
PERFORM  SRMST-UPD
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-UPD
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
ELSE
IF  SRM-STATUS(SRM-IDX) =  0 THEN
MOVE SRM-STATUS(SRM-IDX)  TO  TGT-STATUS
PERFORM  SRMST-UPD
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-UPD
ADD 1 TO KNM-IDX
END-PERFORM
ELSE
IF IS-STS0-FLG = 0 THEN
PERFORM  SRMST-INS
MOVE  1  TO  IS-STS0-FLG
END-IF
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
IF (SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX) = 1)
PERFORM  SRKNM-INS
MOVE 0 TO SRK-IS-STS0-FLG(SRM-IDX,KNM-IDX)
END-IF
ADD 1 TO KNM-IDX
END-PERFORM
MOVE SRM-STATUS(SRM-IDX)  TO  TGT-STATUS
PERFORM  SRMST-UPD
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-UPD
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
END-IF
ELSE
IF  (SRM-SDATE(SRM-IDX)  >  LNK-DATE) THEN
MOVE SRM-STATUS(SRM-IDX)  TO  TGT-STATUS
PERFORM  SRMST-UPD
MOVE  1  TO  KNM-IDX
PERFORM  UNTIL KNM-IDX > CNT-SRKNM(SRM-IDX)
PERFORM  SRKNM-UPD
ADD 1 TO KNM-IDX
END-PERFORM
END-IF
END-IF
END-IF
END-IF
ADD   1  TO  SRM-IDX
END-PERFORM.
SRMST-WRITE-EXT.
EXIT.
